app/controllers/pins_controller.rb

	def index
		@pins = Pin.all.order("created_at DESC")
---
SELECT "pins".* FROM "pins"  ORDER BY created_at DESC

	def destroy
    @pin.destroy
---
DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 4]]

	def create
		@pin = Pin.new(pin_params)
		if @pin.save
---
INSERT INTO "pins" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "fdcvisfdjkfdj"], ["description", "fkf"], ["user_id", "1"], ["created_at", "2015-04-19 13:29:24.263976"], ["updated_at", "2015-04-19 13:29:24.263976"]]

	def update
		if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "this is a new pin image"], ["image_updated_at", "2015-04-20 05:37:48.217489"], ["image_file_name", "imdb.jpg"], ["updated_at", "2015-04-20 05:37:49.223794"], ["id", 9]]

	def find_pin
		@pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 4]]